Repository: capstanlqc-mtpe/CIDQ_BillingCode2026_fr-CA_omt
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr_ca

source: Exit passageways serving as an exit component in a means of egress system shall comply with the requirements of this section.
fr_ca: Les passages de sortie servant d'élément d'issue dans un moyen d'évacuation doivent être conformes aux exigences de la présente section.

source: Exit passageways shall be constructed as fire barriers in accordance with Section 707 or horizontal assemblies constructed in accordance with Section 711, or both.
fr_ca: Les passages d'issue doivent être construits comme des barrières coupe-feu selon la section 707 ou des ensembles horizontaux construits selon la section 711 ou les deux.

source: Exit signs and means of egress illumination required by Chapter 10.
fr_ca: Panneaux de sortie et éclairage des moyens d'évacuation exigés par le chapitre 10.

source: Exits shall be continuous from the point of entry into the exit to the exit discharge.
fr_ca: Les issues doivent être continues du point d'entrée dans l'issue jusqu'à l'issue d'évacuation.

source: Exits shall comply with Sections 1022 through 1027 and the applicable requirements of Sections 1003 through 1015.
fr_ca: Les issues doivent être conformes aux sections 1022 à 1027 et aux exigences applicables des sections 1003 à 1015.

source: Exits shall discharge directly to the exterior of the building.
fr_ca: Les issues doivent permettre l'évacuation directement à l'extérieur du bâtiment.

source: Exposed combustible mantels or trim is permitted to be placed directly on the masonry fireplace front surrounding the fireplace opening providing such combustible materials are not placed within 6 inches (152 mm) of a fireplace opening.
fr_ca: Les manteaux ou les garnitures combustibles exposés peuvent être placés directement sur le devant du foyer en maçonnerie entourant l'ouverture du foyer, à condition que ces matériaux combustibles ne soient pas placés à moins de 6 po [152 mm] d'une ouverture du foyer.

source: Exposed combustible trim and the edges of sheathing materials such as wood siding, flooring and gypsum board shall be permitted to abut the masonry fireplace sidewalls and hearth extension in accordance with Figure R1001.11, provided such combustible trim or sheathing is not less than 12 inches (305 mm) from the inside surface of the nearest firebox lining.
fr_ca: Les garnitures combustibles exposées et les bords des matériaux de revêtement tels que les panneaux de bois, les planchers et les plaques de plâtre peuvent être adjacents aux parois latérales du foyer en maçonnerie et au prolongement de l'âtre conformément à la figure R1001.11, à condition que ces garnitures ou revêtements combustibles ne soient pas à moins de 12 po [305 mm] de la surface intérieure du revêtement de la chambre de combustion le plus proche.

source: Exposed edges of carpet shall be fastened to the floor and shall have trim along the entire length of the exposed edge.
fr_ca: Les bords exposés du tapis doivent être fixés au sol et doivent être garnis sur toute la longueur du bord exposé.

source: Exposed glass edges shall be smooth.
fr_ca: Les bords de verre exposés doivent être lisses.

source: Extensions shall return to a wall, guard, or floor, or shall be continuous to the handrail of an adjacent ramp run.
fr_ca: Les prolongements doivent retourner à un mur, à un garde-corps ou au plancher, ou ils doivent être un prolongement de la rampe d'une rampe adjacente.

source: Extensions shall return to a wall, guard, or the landing surface, or shall be continuous to the handrail of an adjacent stair flight.
fr_ca: Les prolongements doivent retourner à un mur, à un garde-corps ou à la surface du palier, ou ils doivent être continus avec la rampe d'une volée d'escalier adjacente.

source: Exterior areas for assisted rescue in accordance with Section 1009.9.
fr_ca: Zones extérieures pour le sauvetage assisté selon la section 1009.9.

source: Exterior balconies less than 60 square feet (5.6 m2) and only accessed from a door are permitted to have a landing that is less than 36 inches (914 mm) measured in the direction of travel.
fr_ca: Les balcons extérieurs de moins de 60 pieds carrés [5,6 m2] et accessibles uniquement par une porte peuvent avoir un palier de moins de 36 po [914 mm] mesuré dans le sens de déplacement.

source: Exterior decks, patios or balconies that are part of Type B units and have impervious surfaces, and that are not more than 4 inches (102 mm) below the finished floor level of the adjacent interior space of the unit.
fr_ca: Les terrasses, patios ou balcons extérieurs qui font partie d’unités de type B et qui comportent des surfaces imperméables, et qui ne sont pas situés à plus de 4 po (102 mm) au-dessous du niveau du plancher fini de l’espace intérieur adjacent de l’unité.

source: Exterior exit doors shall comply with the applicable requirements of Section 1010.1.
fr_ca: Les portes d'issue extérieures doivent être conformes aux exigences applicables de la section 1010.1.

source: Exterior exit doors shall lead directly to the exit discharge or the public way.
fr_ca: Les portes d'issue extérieures doivent mener directement à l'issue d'évacuation ou à la voie publique.

source: Exterior exit stairways and ramps serving as an element of a required means of egress shall be open on not less than one side, except for required structural columns, beams, handrails and guards.
fr_ca: Les escaliers et les rampes d’issue extérieurs servant d’élément d’un moyen d’évacuation exigé doivent être ouverts sur au moins un côté, à l’exception des poteaux structuraux, des poutres, des mains courantes et des garde-corps exigés.

source: Exterior exit stairways and ramps serving as an exit component in a means of egress system shall comply with the requirements of this section.
fr_ca: Les escaliers et les rampes d'issue extérieurs servant de composant d'issue dans un moyen d'évacuation doivent être conformes aux exigences de la présente section.

source: Exterior exit stairways and ramps serving individual dwelling units of Group R-3 shall have a minimum fire separation distance of 5 feet (1525 mm).
fr_ca: Les escaliers et les rampes d'issue extérieurs desservant les logements individuels du groupe R-3 doivent avoir une distance minimale de séparation coupe-feu de 5 pi (1525 mm).

source: Exterior exit stairways and ramps shall be separated from the interior of the building as required in Section 1023.2.
fr_ca: Les escaliers et les rampes d'issue extérieurs doivent être séparés de l'intérieur du bâtiment conformément à la section 1023.2.

source: Exterior exit stairways and ramps shall have a minimum fire separation distance of 10 feet (3048 mm) measured at right angles from the exterior edge of the stairway or ramps, including landings, to:
fr_ca: Les escaliers et rampes d’issue extérieurs doivent avoir une distance minimale de séparation coupe-feu de 10 pi (3 048 mm), mesurée à angle droit depuis le bord extérieur de l’escalier ou des rampes, y compris les paliers, jusqu’à :

source: Exterior exit stairways shall not be used as an element of a required means of egress for Group I-2 occupancies.
fr_ca: Les escaliers d'évacuation extérieurs ne doivent pas être utilisés comme éléments d'un moyen d'évacuation exigé pour les occupations du groupe I-2.

source: Exterior landings, decks, balconies, stairs and similar facilities shall be positively anchored to the primary structure to resist both vertical and lateral forces or shall be designed to be self-supporting.
fr_ca: Les paliers, les terrasses, les balcons, les escaliers et les installations similaires extérieurs doivent être solidement ancrés à la structure principale pour résister aux forces verticales et latérales ou doivent être conçus pour être autoportants.

source: Exterior openings required for ventilation shall be allowed to open into a sunroom with thermal isolation or a patio cover provided that the openable area between the sunroom addition or patio cover and the interior room shall have an area of not less than 8 percent of the floor area of the interior room or space, but not less than 20 square feet (1.86 m2).
fr_ca: Les ouvertures sur l’extérieur requises pour la ventilation sont autorisées à donner sur une véranda avec isolation thermique ou sur une couverture de terrasse, pourvu que la superficie ouvrante entre l’agrandissement formant véranda ou la couverture de terrasse et la pièce intérieure soit d’au moins 8 % de la superficie de plancher de la pièce ou de l’espace intérieur, sans toutefois être inférieure à 20 pi2 (1,86 m2).

source: Exterior openings that are located on the stage for means of egress or loading and unloading purposes, and that are likely to be open during occupancy of the theater, shall be constructed with vestibules to prevent air drafts into the auditorium.
fr_ca: Les ouvertures extérieures situées sur la scène et destinées aux moyens d’évacuation ou au chargement et au déchargement, et qui sont susceptibles de rester ouvertes pendant l’occupation du théâtre, doivent être aménagées avec des vestibules afin d’empêcher les courants d’air de pénétrer dans l’auditorium.

source: Exterior signs that are not located at the door to the space they serve shall not be required to comply with Section 703.3.
fr_ca: Les enseignes extérieures qui ne sont pas situées à la porte de l'espace qu'elles desservent ne sont pas tenues de se conformer à la section 703.3.

source: Exterior stairways providing access to a basement from the outdoor grade level shall be provided with an artificial light source located at the bottom landing of the stairway.
fr_ca: Les escaliers extérieurs donnant accès à un sous-sol à partir du niveau du sol extérieur doivent être dotés d'une source de lumière artificielle située au palier inférieur de l'escalier.

source: Exterior stairways shall be provided with an artificial light source located at the top landing of the stairway.
fr_ca: Les escaliers extérieurs doivent être dotés d'une source de lumière artificielle située au palier supérieur de l'escalier.

source: Exterior walls of the exit passageway shall comply with Section 705.
fr_ca: Les murs extérieurs du passage d'issue doivent être conformes à la section 705.

source: Exterior walls of the interior exit stairway or ramp shall comply with the requirements of Section 705 for exterior walls.
fr_ca: Les murs extérieurs de l'escalier ou de la rampe d'issue intérieurs doivent être conformes aux exigences de la section 705 pour les murs extérieurs.

source: FIGURE 409.4.6.3LOCATION OF CONTROLS IN PRIVATE RESIDENCE ELEVATORS
fr_ca: FIGURE 409.4.6.3 EMPLACEMENT DES COMMANDES DANS LES ASCENSEURS DE RÉSIDENCES PRIVÉES

source: FLOOR RECPTACLE
fr_ca: PRISE DE PLANCHER

source: Factory-applied or field-applied protective plates are not required to be labeled.
fr_ca: Les plaques de protection appliquées en usine ou sur place ne doivent pas être étiquetées.

source: Fasten to
fr_ca: Fixer à

source: Faucets shall comply with Section 309.
fr_ca: Les robinets doivent être conformes à la section 309.

source: Fences not over 7 feet (2134 mm) high.
fr_ca: Clôtures d’une hauteur maximale de 7 pi (2 134 mm).

source: Field tests shall be conducted upon the completion of an installation or following a major alteration of a personnel hoist
fr_ca: Des essais sur le terrain doivent être effectués à la fin d'une installation ou à la suite d'une modification majeure d'un monte-personne

source: Final building permit valuation shall be set by the building official.
fr_ca: L’évaluation finale du permis de construction doit être établie par le responsable de la construction.

source: Fire alarm systems and smoke alarms shall be provided in Group I-1, R- 1 and R-2 occupancies in accordance with Sections 907.2.6, 907.2.8 and 907.2.9, respectively.
fr_ca: Des systèmes d'alarme d'incendie et des détecteurs de fumée doivent être prévus dans les usages des groupes I-1, R-1 et R-2 selon les sections 907.2.6, 907.2.8 et 907.2.9, respectivement.

source: Fire alarm systems shall be permitted to be used in lieu of smoke alarms and shall comply with Sections R314.7.1 through R314.7.4.
fr_ca: Les systèmes d'alarme incendie peuvent être utilisés à la place des détecteurs de fumée et doivent être conformes aux sections R314.7.1 à R314.7.4.

source: Fire alarm systems shall comply with the provisions of this code and the household fire warning equipment provisions of NFPA 72.
fr_ca: Les systèmes d'alarme d'incendie doivent être conformes aux dispositions du présent code et aux dispositions de la norme NFPA 72 relatives à l'équipement d'avertissement d'incendie domestique.

source: Fire alarm systems.
fr_ca: Systèmes d'alarme d'incendie.

source: Fire areas containing ambulatory care facilities shall be provided with an electronically supervised automatic smoke detection system installed within the ambulatory care facility and in public use areas outside of tenant spaces, including public corridors and elevator lobbies.
fr_ca: Les zones d’incendie comportant des établissements de soins ambulatoires doivent être munies d’un système automatique de détection de fumée surveillé électroniquement, installé dans l’établissement de soins ambulatoires et dans les aires à usage public situées à l’extérieur des locaux des locataires, y compris les corridors publics et les halls d’ascenseur.

source: Fire department glass access panels shall be of tempered glass.
fr_ca: Les panneaux d'accès en verre pour les services d'incendie doivent être en verre trempé.

source: Fire pumps shall be located in rooms protected in accordance with Section 913.2.1.
fr_ca: Les pompes à incendie doivent être situées dans des locaux protégés conformément à l’article 913.2.1.

source: Fire-retardant coatings in existing buildings shall be maintained so as to retain the effectiveness of the treatment under service conditions encountered in actual use.
fr_ca: Les revêtements ignifuges des bâtiments existants doivent être entretenus de manière à conserver l’efficacité du traitement dans les conditions d’utilisation auxquelles ils sont réellement soumis.

source: Firebrick shall conform to ASTM C1261 and shall be laid with medium-duty refractory mortar conforming to ASTM C199.
fr_ca: La brique réfractaire doit être conforme à la norme ASTM C1261 et posée avec du mortier réfractaire de service moyen conforme à la norme ASTM C199.

source: Firebrick shall conform to ASTM C27 or C1261 and shall be laid with medium-duty refractory mortar conforming to ASTM C199.
fr_ca: La brique réfractaire doit être conforme à la norme ASTM C27 ou C1261 et doit être posée avec du mortier réfractaire de service moyen conforme à la norme ASTM C199.

source: Fireplace lintel
fr_ca: Linteau de foyer

source: Fixed or movable walls and partitions, paneling, wall pads and crash pads applied structurally or for decoration, acoustical correction, surface insulation or other purposes shall be considered to be interior finish, shall comply with Section 803 and shall not be considered to be decorative materials or furnishings.
fr_ca: Les murs et cloisons fixes ou mobiles, les panneaux muraux, les panneaux de protection murale et les coussins de protection fixés de façon structurale ou utilisés à des fins de décoration, de correction acoustique, d’isolation de surface ou à d’autres fins doivent être considérés comme des revêtements intérieurs, doivent être conformes à la section 803 et ne doivent pas être considérés comme des matériaux décoratifs ou des éléments d’ameublement.

source: Fixtures on levels not required to be accessible.
fr_ca: Les installations aux étages qui ne doivent pas être accessibles.

source: Fixtures shall be spaced in accordance with Figure R307.1, and in accordance with the requirements of Section P2705.1.
fr_ca: Les appareils sanitaires doivent être espacés conformément à la figure R307.1 et aux exigences de l'article P2705.1.

source: Floor designations shall be located on both jambs of elevator hoistway entrances.
fr_ca: Les désignations d'étage doivent être situées sur les deux montants des entrées de la cage d'ascenseur.

source: Floor drains, sumps and sump pumps shall be permitted at the base of the hoistway enclosure provided that they are indirectly connected to the plumbing system
fr_ca: Les drains de plancher, les puisards et les pompes de puisard sont autorisés à la base de mur de la cage d'ascenseur, à condition qu'ils soient indirectement raccordés au système de plomberie

source: Floor finishes and coverings of a traditional type, such as wood, vinyl, linoleum or terrazzo, and resilient floor covering materials that are not composed of fibers.
fr_ca: Les revêtements et couvre-sols de type traditionnel, tels que le bois, le vinyle, le linoléum ou le terrazzo, ainsi que les matériaux de revêtement de sol résilients qui ne sont pas composés de fibres.

source: Floor receptacle outlets.
fr_ca: Prises de courant au sol.

source: Floor sleepers, bucks and nailing blocks shall not be constructed of combustible materials, unless the space between the fire-resistance-rated floor assembly and the flooring is either solidly filled with noncombustible materials or fireblocked in accordance with Section 718, and provided that such open spaces shall not extend under or through permanent partitions or walls.
fr_ca: Les lambourdes, les bâtis et les blocs de clouage du plancher ne doivent pas être faits de matériaux combustibles, à moins que l’espace entre l’assemblage de plancher coté pour son degré de résistance au feu et le revêtement de sol soit entièrement rempli de matériaux incombustibles ou muni de dispositifs coupe-feu conformément à la section 718, et à condition que ces espaces ouverts ne se prolongent pas sous des cloisons ou des murs permanents ni à travers ceux-ci.

source: Floor surfaces in elevator cars shall comply with Section 302.
fr_ca: Les surfaces de plancher dans les cabines d'ascenseur doivent être conformes à la section 302.

source: Floor surfaces of platform lifts shall comply with Section 302.
fr_ca: Les surfaces de plancher des plates-formes élévatrices doivent être conformes à la section 302.

source: Floor surfaces of ramp runs shall comply with Section 302.
fr_ca: Les surfaces de plancher des volées de rampe doivent être conformes à la section 302.

source: Floor surfaces shall be constructed of impervious, noncorrosive, nonabsorbent and waterproof materials.
fr_ca: Les surfaces de plancher doivent être construites avec des matériaux imperméables, non corrosifs, non absorbants et étanches.

source: Floor surfaces shall be stable, firm, and slip resistant, and shall comply with Section 302.
fr_ca: Les surfaces de plancher doivent être stables, fermes et antidérapantes, et doivent être conformes à la section 302.

source: Floor surfaces under shower heads provided for rinsing laid directly on the ground are not required to comply with this section.
fr_ca: Les surfaces de plancher sous les têtes de mur de douche prévues pour le rinçage et posées directement sur le sol ne sont pas tenues de se conformer à cette section.

source: Floor-ceiling assemblies between dwelling units and sleeping units or between a dwelling unit or sleeping unit and a public or service area within the structure shall have an impact insulation class rating of not less than 50 where tested in accordance with ASTM E492, or have a Normalized Impact Sound Rating (NISR) of not less than 45 if field tested in accordance with ASTM E1007.
fr_ca: Les ensembles plancher-plafond entre des logements et des unités d’habitation destinées au sommeil, ou entre un logement ou une unité d’habitation destinée au sommeil et une aire publique ou de service à l’intérieur du bâtiment, doivent avoir un indice d’isolation aux bruits d’impact d’au moins 50 lorsqu’ils sont soumis à des essais conformément à la norme ASTM E492, ou avoir un indice d’isolation normalisé aux bruits d’impact (NISR) d’au moins 45 lorsqu’ils sont soumis à des essais sur place conformément à la norme ASTM E1007.

source: Floors classified as an open parking garage are not required to be sprinklered.
fr_ca: Les étages classés comme garages de stationnement ouvert ne sont pas tenus d'être équipés d'extincteurs.

source: Floors of fly galleries and catwalks shall be constructed of any approved material.
fr_ca: Les planchers des passerelles suspendues et des grils doivent être construits avec tout matériau approuvé.

source: Floors or receptors under shower compartments shall be laid on, and supported by, a smooth and structurally sound base.
fr_ca: Les sols ou les récepteurs sous les compartiments de douche doivent être posés sur une base de mur lisse et structurellement solide, et soutenus par celle-ci.

source: Floors under shower compartments, except where prefabricated receptors have been provided, shall be lined and made watertight utilizing material complying with Sections 421.5.2.1 through 421.5.2.6.
fr_ca: Les planchers sous les compartiments de douche, sauf si des récepteurs préfabriqués ont été prévus, doivent être revêtus et rendus étanches à l'eau à l'aide de matériaux conformes aux articles 421.5.2.1 à 421.5.2.6.

source: Flush controls shall be hand-operated or automatic.
fr_ca: Les mécanismes de chasse peuvent être manuels ou automatiques.

source: Foam plastic used as trim in any occupancy shall comply with Section 2604.2.
fr_ca: La mousse plastique utilisée comme élément de finition dans tout usage doit être conforme à la section 2604.2.

source: Foam plastics and materials containing foam plastics shall comply with Section 2603 and the International Fire Code.
fr_ca: Les plastiques en mousse et les matériaux contenant des plastiques en mousse doivent être conformes à la section 2603 et à l'International Fire Code.

source: Foam plastics shall not be used as interior finish except as provided in Section 803.4.
fr_ca: Les mousses plastiques ne doivent pas être utilisées comme finition intérieure, sauf dans les cas prévus à la section 803.4.

source: Foam plastics shall not be used as interior trim except as provided in Section 806.5 or 2604.2.
fr_ca: Les mousses plastiques ne doivent pas être utilisées comme finition intérieure, sauf dans les cas prévus aux sections 806.5 ou 2604.2.

source: Footing
fr_ca: Semelle

source: Footing and foundation inspections shall be made after excavations for footings are complete and any required reinforcing steel is in place.
fr_ca: Les inspections des semelles et des fondations doivent être effectuées après l’achèvement des excavations pour les semelles et la mise en place de tout l’acier d’armature requis.

source: Footings for masonry fireplaces and their chimneys shall be constructed of concrete or solid masonry not less than 12 inches (305 mm) thick and shall extend not less than 6 inches (152 mm) beyond the face of the fireplace or foundation wall on all sides.
fr_ca: Les semelles des foyers en maçonnerie et de leurs cheminées doivent être construites en béton ou en maçonnerie pleine d'au moins 12 po [305 mm] d'épaisseur et doivent se prolonger d'au moins 6 po [152 mm] au-delà de la face du foyer ou du mur de fondation de tous les côtés.

source: Footings shall be founded on natural, undisturbed earth or engineered fill below frost depth.
fr_ca: Les semelles doivent être fondées sur de la terre naturelle non perturbée ou sur un remblai aménagé sous la profondeur de gel.

source: For Group I-1, Condition 1 occupancies, smoke detection in habitable spaces is not required where the facility is equipped throughout with an automatic sprinkler system installed in accordance with Section 903.3.1.1.
fr_ca: Pour les usages du groupe I-1, condition 1, la détection de fumée dans les espaces habitables n’est pas requise lorsque l’établissement est entièrement équipé d’un système d’extincteurs automatiques installé conformément à la section 903.3.1.1.
